# 1. Вывести список установленных пакетов в консоли cmd/Pycharm и сделать скрин установленных пакетов
# 2. Установить любую стороннюю библиотеку
# 3. Вывести и сделать скрин нового списка установленных пакетов в консоли cmd/Pycharm
# 4. Удалить установленную библиотеку и проверить, что удалилась
#
# Итогом должно быть три скрина: Первый до установки библиотеки, второй после установки библиотеки, третий после удаления.
"""
auto_test_course\lection6\Unicorn_удалён.PNG
auto_test_course\lection6\До_устновки_пакета.PNG
auto_test_course\lection6\Установлен_Unicorn.PNG
"""